In [1]:
import pandas as pd 
import numpy as np

In [2]:
df = pd.read_csv("../dataset/stream.csv")
df.head()

,index,date,open,close,low,high,volume
0,596153,2022-01-03 09:15:00+05:30,17387.15,17428.90,17387.15,17438.40,0
1,596154,2022-01-03 09:16:00+05:30,17428.40,17450.55,17428.40,17451.45,0
2,596155,2022-01-03 09:17:00+05:30,17450.05,17457.70,17442.05,17459.55,0
3,596156,2022-01-03 09:18:00+05:30,17455.95,17464.55,17455.30,17465.75,0
4,596157,2022-01-03 09:19:00+05:30,17465.25,17473.20,17462.15,17474.65,0

In [4]:
df.drop('index', axis=1, inplace=True)
df.head()

                        date      open     close       low      high  volume
0  2022-01-03 09:15:00+05:30  17387.15  17428.90  17387.15  17438.40       0
1  2022-01-03 09:16:00+05:30  17428.40  17450.55  17428.40  17451.45       0
2  2022-01-03 09:17:00+05:30  17450.05  17457.70  17442.05  17459.55       0
3  2022-01-03 09:18:00+05:30  17455.95  17464.55  17455.30  17465.75       0
4  2022-01-03 09:19:00+05:30  17465.25  17473.20  17462.15  17474.65       0

In [5]:
df.to_csv('../dataset/stream.csv')

In [2]:
df = pd.read_csv('../dataset/batch.csv')
df.head()

                        date     open    close      low     high  volume
0  2015-01-09 10:18:00+05:30  8280.70  8283.35  8279.40  8283.35       0
1  2015-01-09 10:19:00+05:30  8283.05  8283.35  8281.05  8283.70       0
2  2015-01-09 10:20:00+05:30  8283.65  8283.95  8283.10  8284.15       0
3  2015-01-09 10:21:00+05:30  8283.75  8285.75  8283.60  8285.75       0
4  2015-01-09 10:22:00+05:30  8286.20  8286.80  8285.75  8287.70       0